"There was an error in processing the images." = "Une erreur est survenue lors du traitement des images.";

"The MakePDF application not found on this system." = "L’application MakePDF est introuvable sur cet ordinateur.";